modm-ext/data.modm.io/docs/svd/header_stm32u595xx.svd
        <register>
          <name>CFGR2</name>
          <description>ADC Configuration register 2</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ROVSE</name>
              <description>ADC Regular group oversampler enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JOVSE</name>
              <description>ADC Injected group oversampler enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVSS</name>
              <description>ADC Regular Oversampling shift</description>
              <bitOffset>5</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>ADC oversampling no shift (sum of the ADC conversions data is not divided to result as the ADC oversampling conversion data)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RIGHT_1</name>
                  <description>ADC oversampling shift of 1 (sum of the ADC conversions data is divided by 2 to result as the ADC oversampling conversion data)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RIGHT_2</name>
                  <description>ADC oversampling shift of 2 (sum of the ADC conversions data is divided by 4 to result as the ADC oversampling conversion data)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RIGHT_3</name>
                  <description>ADC oversampling shift of 3 (sum of the ADC conversions data is divided by 8 to result as the ADC oversampling conversion data)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RIGHT_4</name>
                  <description>ADC oversampling shift of 4 (sum of the ADC conversions data is divided by 16 to result as the ADC oversampling conversion data)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RIGHT_5</name>
                  <description>ADC oversampling shift of 5 (sum of the ADC conversions data is divided by 32 to result as the ADC oversampling conversion data)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RIGHT_6</name>
                  <description>ADC oversampling shift of 6 (sum of the ADC conversions data is divided by 64 to result as the ADC oversampling conversion data)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RIGHT_7</name>
                  <description>ADC oversampling shift of 7 (sum of the ADC conversions data is divided by 128 to result as the ADC oversampling conversion data)</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RIGHT_8</name>
                  <description>ADC oversampling shift of 8 (sum of the ADC conversions data is divided by 256 to result as the ADC oversampling conversion data)</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RIGHT_9</name>
                  <description>ADC oversampling shift of 9 (sum of the ADC conversions data is divided by 512 to result as the ADC oversampling conversion data)</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RIGHT_10</name>
                  <description>ADC oversampling shift of 10 (sum of the ADC conversions data is divided by 1024 to result as the ADC oversampling conversion data)</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RIGHT_11</name>
                  <description>ADC oversampling shift of 11 (sum of the ADC conversions data is divided by 2048 to result as the ADC oversampling conversion data)</description>
                  <value>11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TROVS</name>
              <description>ADC Triggered regular Oversampling</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CONT</name>
                  <description>ADC oversampling discontinuous mode: continuous mode (all conversions of oversampling ratio are done from 1 trigger)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISCONT</name>
                  <description>ADC oversampling discontinuous mode: discontinuous mode (each conversion of oversampling ratio needs a trigger)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ROVSM</name>
              <description>ADC Regular oversampling mode</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BULB</name>
              <description>ADC Bulb sampling mode</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWTRIG</name>
              <description>ADC Software trigger bit for sampling time control trigger mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SMPTRIG</name>
              <description>ADC Sampling time control trigger mode</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVSR</name>
              <description>ADC oversampling Ratio</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>LFTRIG</name>
              <description>ADC low frequency trigger mode</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LSHIFT</name>
              <description>ADC Left shift factor</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPR1</name>
          <description>ADC sample time register 1</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SMP0</name>
              <description>ADC Channel 0 Sampling time selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP1</name>
              <description>ADC Channel 1 Sampling time selection</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP2</name>
              <description>ADC Channel 2 Sampling time selection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP3</name>
              <description>ADC Channel 3 Sampling time selection</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP4</name>
              <description>ADC Channel 4 Sampling time selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP5</name>
              <description>ADC Channel 5 Sampling time selection</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP6</name>
              <description>ADC Channel 6 Sampling time selection</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP7</name>
              <description>ADC Channel 7 Sampling time selection</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP8</name>
              <description>ADC Channel 8 Sampling time selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP9</name>
              <description>ADC Channel 9 Sampling time selection</description>
              <bitOffset>27</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPR2</name>
          <description>ADC sample time register 2</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SMP10</name>
              <description>ADC Channel 10 Sampling time selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP11</name>
              <description>ADC Channel 11 Sampling time selection</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP12</name>
              <description>ADC Channel 12 Sampling time selection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP13</name>
              <description>ADC Channel 13 Sampling time selection</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP14</name>
              <description>ADC Channel 14 Sampling time selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP15</name>
              <description>ADC Channel 15 Sampling time selection</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP16</name>
              <description>ADC Channel 16 Sampling time selection</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP17</name>
              <description>ADC Channel 17 Sampling time selection</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP18</name>
              <description>ADC Channel 18 Sampling time selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP19</name>
              <description>ADC Channel 19 Sampling time selection</description>
              <bitOffset>27</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCSEL</name>
          <description>ADC pre-channel selection</description>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PCSEL</name>
              <description>ADC pre channel selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AWD1TR</name>
          <description>ADC watchdog threshold register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LT1</name>
              <description>ADC analog watchdog 1 threshold low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>HT1</name>
              <description>ADC Analog watchdog 1 threshold high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AWD2TR</name>
          <description>ADC watchdog threshold register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LT2</name>
              <description>ADC analog watchdog 2 threshold low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>HT2</name>
              <description>ADC analog watchdog 2 threshold high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CHSELR</name>
          <description>ADC channel select register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHSEL0</name>
              <description>ADC group regular sequencer channel 0, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL1</name>
              <description>ADC group regular sequencer channel 1, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL2</name>
              <description>ADC group regular sequencer channel 2, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL3</name>
              <description>ADC group regular sequencer channel 3, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL4</name>
              <description>ADC group regular sequencer channel 4, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL5</name>
              <description>ADC group regular sequencer channel 5, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL6</name>
              <description>ADC group regular sequencer channel 6, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL7</name>
              <description>ADC group regular sequencer channel 7, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL8</name>
              <description>ADC group regular sequencer channel 8, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL9</name>
              <description>ADC group regular sequencer channel 9, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL10</name>
              <description>ADC group regular sequencer channel 10, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL11</name>
              <description>ADC group regular sequencer channel 11, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL12</name>
              <description>ADC group regular sequencer channel 12, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL13</name>
              <description>ADC group regular sequencer channel 13, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL14</name>
              <description>ADC group regular sequencer channel 14, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL15</name>
              <description>ADC group regular sequencer channel 15, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL16</name>
              <description>ADC group regular sequencer channel 16, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL17</name>
              <description>ADC group regular sequencer channel 17, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL18</name>
              <description>ADC group regular sequencer channel 18, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL19</name>
              <description>ADC group regular sequencer channel 18, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL20</name>
              <description>ADC group regular sequencer channel 18, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL21</name>
              <description>ADC group regular sequencer channel 18, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL22</name>
              <description>ADC group regular sequencer channel 18, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL23</name>
              <description>ADC group regular sequencer channel 18, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SQ7</name>
              <description>ADC group regular sequencer rank 7, available when ADC_CFGR1_CHSELRMOD is set</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SQ8</name>
              <description>ADC group regular sequencer rank 8, available when ADC_CFGR1_CHSELRMOD is set</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
