modm-ext/data.modm.io/docs/svd/header_stm32u595xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>OCTOSPIM</name>
      <description>Serial Peripheral Interface IO Manager</description>
      <baseAddress>0x420c4000</baseAddress>
      <registers>
        <register>
          <name>CR</name>
          <description>OCTOSPIM IO Manager Control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MUXEN</name>
              <description>Multiplexed Mode Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>REQ2ACK_TIME</name>
              <description>REQ to ACK Time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCR0</name>
          <description>OCTOSPIM IO Manager Port[1:8] Configuration register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CLKEN</name>
              <description>CLK/CLKn Enable for Port n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLKSRC</name>
              <description>CLK/CLKn Source for Port n</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DQSEN</name>
              <description>DQS Enable for Port n</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DQSSRC</name>
              <description>DQS Source for Port n</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NCSEN</name>
              <description>nCS Enable for Port n</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NCSSRC</name>
              <description>nCS Source for Port n</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IOLEN</name>
              <description>IO[3:0] Enable for Port n</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IOLSRC</name>
              <description>IO[3:0] Source for Port n</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>IOHEN</name>
              <description>IO[7:4] Enable for Port n</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IOHSRC</name>
              <description>IO[7:4] Source for Port n</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCR1</name>
          <description>OCTOSPIM IO Manager Port[1:8] Configuration register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CLKEN</name>
              <description>CLK/CLKn Enable for Port n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLKSRC</name>
              <description>CLK/CLKn Source for Port n</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DQSEN</name>
              <description>DQS Enable for Port n</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DQSSRC</name>
              <description>DQS Source for Port n</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NCSEN</name>
              <description>nCS Enable for Port n</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NCSSRC</name>
              <description>nCS Source for Port n</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IOLEN</name>
              <description>IO[3:0] Enable for Port n</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IOLSRC</name>
              <description>IO[3:0] Source for Port n</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>IOHEN</name>
              <description>IO[7:4] Enable for Port n</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IOHSRC</name>
              <description>IO[7:4] Source for Port n</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCR2</name>
          <description>OCTOSPIM IO Manager Port[1:8] Configuration register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CLKEN</name>
              <description>CLK/CLKn Enable for Port n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLKSRC</name>
              <description>CLK/CLKn Source for Port n</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DQSEN</name>
              <description>DQS Enable for Port n</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DQSSRC</name>
              <description>DQS Source for Port n</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NCSEN</name>
              <description>nCS Enable for Port n</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NCSSRC</name>
              <description>nCS Source for Port n</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IOLEN</name>
              <description>IO[3:0] Enable for Port n</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IOLSRC</name>
              <description>IO[3:0] Source for Port n</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>IOHEN</name>
              <description>IO[7:4] Enable for Port n</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IOHSRC</name>
              <description>IO[7:4] Source for Port n</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCR3</name>
          <description>OCTOSPIM IO Manager Port[1:8] Configuration register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CLKEN</name>
              <description>CLK/CLKn Enable for Port n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLKSRC</name>
              <description>CLK/CLKn Source for Port n</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DQSEN</name>
              <description>DQS Enable for Port n</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DQSSRC</name>
              <description>DQS Source for Port n</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NCSEN</name>
              <description>nCS Enable for Port n</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NCSSRC</name>
              <description>nCS Source for Port n</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IOLEN</name>
              <description>IO[3:0] Enable for Port n</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IOLSRC</name>
              <description>IO[3:0] Source for Port n</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>IOHEN</name>
              <description>IO[7:4] Enable for Port n</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IOHSRC</name>
              <description>IO[7:4] Source for Port n</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCR4</name>
          <description>OCTOSPIM IO Manager Port[1:8] Configuration register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CLKEN</name>
              <description>CLK/CLKn Enable for Port n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLKSRC</name>
              <description>CLK/CLKn Source for Port n</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DQSEN</name>
              <description>DQS Enable for Port n</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DQSSRC</name>
              <description>DQS Source for Port n</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NCSEN</name>
              <description>nCS Enable for Port n</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NCSSRC</name>
              <description>nCS Source for Port n</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IOLEN</name>
              <description>IO[3:0] Enable for Port n</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IOLSRC</name>
              <description>IO[3:0] Source for Port n</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>IOHEN</name>
              <description>IO[7:4] Enable for Port n</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IOHSRC</name>
              <description>IO[7:4] Source for Port n</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCR5</name>
          <description>OCTOSPIM IO Manager Port[1:8] Configuration register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CLKEN</name>
              <description>CLK/CLKn Enable for Port n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLKSRC</name>
              <description>CLK/CLKn Source for Port n</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DQSEN</name>
              <description>DQS Enable for Port n</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DQSSRC</name>
              <description>DQS Source for Port n</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NCSEN</name>
              <description>nCS Enable for Port n</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NCSSRC</name>
              <description>nCS Source for Port n</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IOLEN</name>
              <description>IO[3:0] Enable for Port n</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IOLSRC</name>
              <description>IO[3:0] Source for Port n</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>IOHEN</name>
              <description>IO[7:4] Enable for Port n</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IOHSRC</name>
              <description>IO[7:4] Source for Port n</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCR6</name>
          <description>OCTOSPIM IO Manager Port[1:8] Configuration register</description>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CLKEN</name>
              <description>CLK/CLKn Enable for Port n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLKSRC</name>
              <description>CLK/CLKn Source for Port n</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DQSEN</name>
              <description>DQS Enable for Port n</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DQSSRC</name>
              <description>DQS Source for Port n</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NCSEN</name>
              <description>nCS Enable for Port n</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NCSSRC</name>
              <description>nCS Source for Port n</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IOLEN</name>
              <description>IO[3:0] Enable for Port n</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IOLSRC</name>
              <description>IO[3:0] Source for Port n</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>IOHEN</name>
              <description>IO[7:4] Enable for Port n</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IOHSRC</name>
              <description>IO[7:4] Source for Port n</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCR7</name>
          <description>OCTOSPIM IO Manager Port[1:8] Configuration register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CLKEN</name>
              <description>CLK/CLKn Enable for Port n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLKSRC</name>
              <description>CLK/CLKn Source for Port n</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DQSEN</name>
              <description>DQS Enable for Port n</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DQSSRC</name>
              <description>DQS Source for Port n</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NCSEN</name>
              <description>nCS Enable for Port n</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NCSSRC</name>
              <description>nCS Source for Port n</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IOLEN</name>
              <description>IO[3:0] Enable for Port n</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IOLSRC</name>
              <description>IO[3:0] Source for Port n</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>IOHEN</name>
              <description>IO[7:4] Enable for Port n</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IOHSRC</name>
              <description>IO[7:4] Source for Port n</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
