modm-ext/data.modm.io/docs/svd/header_stm32u595xx.svd
        <register>
          <name>CR4</name>
          <description>Power power control register 4</description>
          <addressOffset>0xa8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SRAM1PDS4</name>
              <description>SRAM1 page 4 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM1PDS5</name>
              <description>SRAM1 page 5 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM1PDS6</name>
              <description>SRAM1 page 6 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM1PDS7</name>
              <description>SRAM1 page 7 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM1PDS8</name>
              <description>SRAM1 page 8 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM1PDS9</name>
              <description>SRAM1 page 9 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM1PDS10</name>
              <description>SRAM1 page 10 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM1PDS11</name>
              <description>SRAM1 page 11 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM1PDS12</name>
              <description>SRAM1 page 12 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM3PDS9</name>
              <description>SRAM3 page 9 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM3PDS10</name>
              <description>SRAM3 page 10 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM3PDS11</name>
              <description>SRAM3 page 11 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM3PDS12</name>
              <description>SRAM3 page 12 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM3PDS13</name>
              <description>SRAM3 page 13 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM5PDS1</name>
              <description>SRAM5 page 1 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM5PDS2</name>
              <description>SRAM5 page 2 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM5PDS3</name>
              <description>SRAM5 page 3 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM5PDS4</name>
              <description>SRAM5 page 4 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM5PDS5</name>
              <description>SRAM5 page 5 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM5PDS6</name>
              <description>SRAM5 page 6 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM5PDS7</name>
              <description>SRAM5 page 7 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM5PDS8</name>
              <description>SRAM5 page 8 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM5PDS9</name>
              <description>SRAM5 page 9 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM5PDS10</name>
              <description>SRAM5 page 10 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM5PDS11</name>
              <description>SRAM5 page 11 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM5PDS12</name>
              <description>SRAM5 page 12 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM5PDS13</name>
              <description>SRAM5 page 13 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
