modm-ext/data.modm.io/docs/svd/header_stm32u595xx.svd
    <peripheral derivedFrom="HSPI1">
      <name>HSPI1_S</name>
      <description>HEXA and OCTO Serial Peripheral Interface</description>
      <baseAddress>0x520d3400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="SYSCFG">
      <name>SYSCFG_S</name>
      <description>System configuration controller</description>
      <baseAddress>0x56000400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="SPI2">
      <name>SPI3_S</name>
      <description>SPI</description>
      <baseAddress>0x56002000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="LPUART1">
      <name>LPUART1_S</name>
      <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
      <baseAddress>0x56002400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C3_S</name>
      <description>Inter-integrated Circuit Interface</description>
      <baseAddress>0x56002800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="LPTIM2">
      <name>LPTIM1_S</name>
      <description>LPTIMER</description>
      <baseAddress>0x56004400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="LPTIM2">
      <name>LPTIM3_S</name>
      <description>LPTIMER</description>
      <baseAddress>0x56004800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="LPTIM2">
      <name>LPTIM4_S</name>
      <description>LPTIMER</description>
      <baseAddress>0x56004c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="OPAMP12_COMMON">
      <name>OPAMP12_COMMON_S</name>
      <baseAddress>0x56005000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="OPAMP1">
      <name>OPAMP1_S</name>
      <description>Operational Amplifier (OPAMP)</description>
      <alternatePeripheral>OPAMP12_COMMON_S</alternatePeripheral>
      <baseAddress>0x56005000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="OPAMP1">
      <name>OPAMP_S</name>
      <description>Operational Amplifier (OPAMP)</description>
      <alternatePeripheral>OPAMP12_COMMON_S</alternatePeripheral>
      <baseAddress>0x56005000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="OPAMP1">
      <name>OPAMP2_S</name>
      <description>Operational Amplifier (OPAMP)</description>
      <baseAddress>0x56005010</baseAddress>
    </peripheral>
    <peripheral derivedFrom="COMP12">
      <name>COMP12_S</name>
      <description>Comparator</description>
      <baseAddress>0x56005400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="COMP1">
      <name>COMP1_S</name>
      <description>Comparator</description>
      <alternatePeripheral>COMP12_S</alternatePeripheral>
      <baseAddress>0x56005400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="COMP1">
      <name>COMP2_S</name>
      <description>Comparator</description>
      <baseAddress>0x56005404</baseAddress>
    </peripheral>
    <peripheral derivedFrom="VREFBUF">
      <name>VREFBUF_S</name>
      <description>VREFBUF</description>
      <baseAddress>0x56007400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="RTC">
      <name>RTC_S</name>
      <description>Real-Time Clock</description>
      <baseAddress>0x56007800</baseAddress>
      <interrupt>
        <name>RTC_S</name>
        <description>RTC secure interrupt</description>
        <value>3</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="TAMP">
      <name>TAMP_S</name>
      <description>Tamper and backup registers</description>
      <baseAddress>0x56007c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="LPGPIO1">
      <name>LPGPIO1_S</name>
      <description>General Purpose I/O</description>
      <baseAddress>0x56020000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="PWR">
      <name>PWR_S</name>
      <description>Power Control</description>
      <baseAddress>0x56020800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="RCC">
      <name>RCC_S</name>
      <description>Reset and Clock Control</description>
      <baseAddress>0x56020c00</baseAddress>
      <interrupt>
        <name>RCC_S</name>
        <description>RCC secure global interrupt</description>
        <value>10</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="ADC4">
      <name>ADC4_S</name>
      <description>ADC</description>
      <baseAddress>0x56021000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="DAC1">
      <name>DAC1_S</name>
      <description>DAC</description>
      <baseAddress>0x56021800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="EXTI">
      <name>EXTI_S</name>
      <description>Asynch Interrupt/Event Controller (EXTI)</description>
      <baseAddress>0x56022000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GTZC_TZSC2">
      <name>GTZC_TZSC2_S</name>
      <description>Global TrustZone Controller</description>
      <baseAddress>0x56023000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GTZC_TZIC2">
      <name>GTZC_TZIC2_S</name>
      <baseAddress>0x56023400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GTZC_MPCBB1">
      <name>GTZC_MPCBB4_S</name>
      <baseAddress>0x56023800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="ADF1">
      <name>ADF1_S</name>
      <description>MDF/ADF</description>
      <baseAddress>0x56024000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="LPDMA1">
      <name>LPDMA1_S</name>
      <description>DMA Controller</description>
      <baseAddress>0x56025000</baseAddress>
    </peripheral>
    <peripheral>
      <name>DBGMCU</name>
      <description>Debug MCU</description>
      <baseAddress>0xe0044000</baseAddress>
      <registers>
        <register>
          <name>IDCODE</name>
          <description>MCU device ID code</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DEV_ID</name>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>REV_ID</name>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <description>Debug MCU configuration register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DBG_STOP</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_STANDBY</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRACE_IOEN</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRACE_CLKEN</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRACE_MODE</name>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>APB1FZR1</name>
          <description>Debug MCU APB1 freeze register 1</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DBG_TIM2_STOP</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_TIM3_STOP</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_TIM4_STOP</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_TIM5_STOP</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_TIM6_STOP</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_TIM7_STOP</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_WWDG_STOP</name>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_IWDG_STOP</name>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_I2C1_STOP</name>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_I2C2_STOP</name>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>APB1FZR2</name>
          <description>Debug MCU APB1 freeze register 2</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DBG_I2C4_STOP</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_LPTIM2_STOP</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_I2C5_STOP</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_I2C6_STOP</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2FZR</name>
          <description>Debug MCU APB2 freeze register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DBG_TIM1_STOP</name>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_TIM8_STOP</name>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_TIM15_STOP</name>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_TIM16_STOP</name>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_TIM17_STOP</name>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>APB3FZR</name>
          <description>Debug MCU APB3 freeze register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DBG_I2C3_STOP</name>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_LPTIM1_STOP</name>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_LPTIM3_STOP</name>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_LPTIM4_STOP</name>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_RTC_STOP</name>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB1FZR</name>
          <description>Debug MCU AHB1 freeze register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DBG_GPDMA0_STOP</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_GPDMA1_STOP</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_GPDMA2_STOP</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_GPDMA3_STOP</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_GPDMA4_STOP</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_GPDMA5_STOP</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_GPDMA6_STOP</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_GPDMA7_STOP</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_GPDMA8_STOP</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_GPDMA9_STOP</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_GPDMA10_STOP</name>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_GPDMA11_STOP</name>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_GPDMA12_STOP</name>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_GPDMA13_STOP</name>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_GPDMA14_STOP</name>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_GPDMA15_STOP</name>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB3FZR</name>
          <description>Debug MCU AHB3 freeze register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DBG_LPDMA0_STOP</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_LPDMA1_STOP</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_LPDMA2_STOP</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_LPDMA3_STOP</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>
